Revit 2027 API
BuiltInFailures.DesignOptionFailures.CannotPutZoneInOption Property
 HVAC Zones must be in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPutZoneInOption { get; }
Public Shared ReadOnly Property CannotPutZoneInOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPutZoneInOption {
	FailureDefinitionId^ get ();
}
static member CannotPutZoneInOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace